In [ ]:
# ## Typecast to Categorical column in pandas

In [ ]:
df1['Is_Male'] = df1.Is_Male.astype('category')

df1.dtypes

In [1]:
# Convert column to categorical in pandas python using categorical() function

In [ ]:
df1['Is_Male'] = pd.Categorical(df1.Is_Male)

df1.dtypes

In [ ]:
from sklearn.preprocessing import LabelEncoder

lb_make = LabelEncoder()
obj_df["make_code"] = lb_make.fit_transform(obj_df["make"])
obj_df[["make", "make_code"]].head(11)

In [ ]:
PD.CUT(column, bins=[ ],labels=[ ])

In [ ]:
pd.cut(df.Age,bins=[0,2,17,65,99],labels=['Toddler/Baby','Child','Adult','Elderly'])

In [ ]:
df['Age Group'].value_counts(normalize=True)

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as stats
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"]=(10,8)

import warnings
warnings.filterwarnings('ignore')

In [3]:
house_data = pd.read_csv('C:/Users/aozde/OneDrive/Documents/CapstoneProject/HouseData/Home/house_data.csv')
x_h=house_data.copy()
pd.set_option("display.float_format", "{:.2f}".format)
x_h.head(5)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.00,3,1.00,1180,5650,1.00,0,0,...,7,1180,0,1955,0,98178,47.51,-122.26,1340,5650
1,6414100192,20141209T000000,538000.00,3,2.25,2570,7242,2.00,0,0,...,7,2170,400,1951,1991,98125,47.72,-122.32,1690,7639
2,5631500400,20150225T000000,180000.00,2,1.00,770,10000,1.00,0,0,...,6,770,0,1933,0,98028,47.74,-122.23,2720,8062
3,2487200875,20141209T000000,604000.00,4,3.00,1960,5000,1.00,0,0,...,7,1050,910,1965,0,98136,47.52,-122.39,1360,5000
4,1954400510,20150218T000000,510000.00,3,2.00,1680,8080,1.00,0,0,...,8,1680,0,1987,0,98074,47.62,-122.05,1800,7503

In [4]:
cols = ['zipcode','lat','long']
x = x_h[cols]
x.head()

   zipcode   lat    long
0    98178 47.51 -122.26
1    98125 47.72 -122.32
2    98028 47.74 -122.23
3    98136 47.52 -122.39
4    98074 47.62 -122.05

In [12]:
from sklearn.preprocessing import LabelEncoder

lb_make = LabelEncoder()
x["new_zipcode"] = lb_make.fit_transform(x["zipcode"])
x[["zipcode", "new_zipcode"]].head(11)

    zipcode  new_zipcode
0        66           66
1        55           55
2        16           16
3        58           58
4        37           37
5        29           29
6         2            2
7        68           68
8        60           60
9        23           23
10        6            6

In [16]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   zipcode        21613 non-null  int64
 1   lat            21613 non-null  float64
 2   long           21613 non-null  float64
 3   categ_zipcode  21613 non-null  int64
 4   new_zipcode    21613 non-null  int64
dtypes: float64(2), int64(3)
memory usage: 844.4 KB

In [17]:
x['new_zipcode'] = x.new_zipcode.astype('category')

x.dtypes

zipcode             int64
lat               float64
long              float64
categ_zipcode       int64
new_zipcode      category
dtype: object

In [18]:
x.head()

   zipcode   lat    long  categ_zipcode new_zipcode
0       66 47.51 -122.26             66          66
1       55 47.72 -122.32             55          55
2       16 47.74 -122.23             16          16
3       58 47.52 -122.39             58          58
4       37 47.62 -122.05             37          37

In [20]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   zipcode        21613 non-null  int64
 1   lat            21613 non-null  float64
 2   long           21613 non-null  float64
 3   categ_zipcode  21613 non-null  int64
 4   new_zipcode    21613 non-null  category
dtypes: category(1), float64(2), int64(2)
memory usage: 699.7 KB

In [24]:
x.drop(['zipcode','categ_zipcode'],axis=1,inplace=True)
x.head()

    lat    long new_zipcode
0 47.51 -122.26          66
1 47.72 -122.32          55
2 47.74 -122.23          16
3 47.52 -122.39          58
4 47.62 -122.05          37

In [25]:
x['new_zipcode'].value_counts(normalize=True)

42   0.03
23   0.03
49   0.03
28   0.03
51   0.03
     ...
41   0.00
8    0.00
14   0.00
61   0.00
24   0.00
Name: new_zipcode, Length: 70, dtype: float64

In [26]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   lat          21613 non-null  float64
 1   long         21613 non-null  float64
 2   new_zipcode  21613 non-null  category
dtypes: category(1), float64(2)
memory usage: 362.0 KB